{
  "name": "eng",
  "icon": "🇬🇧",
  "text": [
    "Maheut Nicolas",
    "CV",
    "Introduction",
    "Expérience",
    "Projet",
    "Contacter Moi",
    "Bienvenue",
    "<b>Click</b> on the right image for my CV",
    "<b>Click</b> on the bottom image for my CV",
    "<b>Scroll down</b> for my presentation",
    "7 years in cuisine",
    "I worked for <b>7 years</b> as a cook, including 2 years also as a waiter.<br>I worked in <b>4 restaurants</b> after my diplomas",
    "My passions",
    "I like <b>learning</b>, I am a naturally curious person.<br>For this reason, I discovered the <b>game of Go</b>, loved <b>unicycling</b>.<br>I am passionate about <b>puzzle games</b> as well.",
    "My skills",
    "My passion for puzzle games has developed my ability to <b>solve problems</b>.<br>I became good at <b>communication</b> through my experience as a waiter.<br>Finally, I acquired a good <b>tolerance to stress</b> as a cook.",
    "Other skills",
    "I am also interested in <b>accounting</b> having done a BTS focused on management, this skill has allowed me to <b>advise</b> people as well as <b>invest</b> in the stock market.",
    "Why Dev?",
    "After following a friend's recommendation and out of curiosity,<br>I started coding for fun <b>4 years</b> ago and I loved it.<br>I can <b>solve problems</b> and build something.",
    "Career change",
    "I want to change careers for the <b>challenge</b> and expand my horizons while I'm young.<br>Computer development is the path I want to follow. And with my experiences,<br>I can bring <b>another perspective</b> than those who followed a traditional path.",
    "My learning and professional experience",
    "Details of my journey",
    "Professional Cook Bac",
    "I studied for <b>3 years</b> to obtain my professional cook diploma. I also did 3 internships:<br>- Auberge de l'âtre<br>- Château de Saint de Sabine<br>- Hotel Adler (Germany)",
    "BTS Hospitality and Catering",
    "I studied for <b>2 years</b> to obtain my BTS in marketing and management, I also did an internship as a manager at Flunch.",
    "Hotel du Commerce",
    "<b>2 months</b> as a dishwasher and kitchen assistant, right after my diplomas.",
    "Café Leo",
    "Short experiences of <b>2 months</b>,<br>I learned more about inventory management and organization.",
    "Abbaye de la Bussière",
    "I worked for a MOF (Best Craftsman of France), learning all the missing basics of the profession for <b>1 year</b>.",
    "Ritchie's Dinners",
    "For <b>4 years</b>, I worked as a cook and the last 2 years also as a waiter.",
    "CS50 computer science",
    "I took <b>CS50</b> after my working hours and <b>3 years</b> of self-learning.",
    "My developer projects",
    "The projects that made me grow as a developer.",
    "I.Tic Tac Toe",
    "My first program in <b>Java</b>, a very simple and poorly implemented program. I did it with Java <b>Swing</b>, which is largely obsolete.",
    "II.Margin Calculation",
    "After learning from my mistakes, I tried to code a useful program in <b>Java</b>,<br> The program calculates margins with a list of fixed and variable costs.",
    "III.Text-based RPG",
    "In object-oriented programming.<br>I developed a small RPG in <b>JavaFX</b> and <b>SQLite</b> for the DB. With little knowledge in the subject, the structure being too complicated, I completely restarted the project 3 times.",
    "IV.Pathfinding Algorithm",
    "In pair programming, we developed a pathfinding program from scratch: Breath search.<br>We visit the surrounding squares, calculate the distance (Pythagoras) and classify them in a list of squares to be visited. Implemented in <b>Javascript.</b>",
    "V.Minecraft Plugin",
    "I helped maintain a Minecraft server. I learned to read and analyze code that was not mine.<br>Minecraft is a game made in <b>Java</b>",
    "VI.WebSite Margin",
    "My biggest project. I rewrote all the code for Margin Calculation to install it on the web. With a front-end in <b>JS</b>, a back-end in <b>Java</b> with <b>Spring Boot</b> and a DB with <b>MySQL</b>. I installed everything on a Ubuntu server that I rented.",
    "VII.CS50",
    "Other than a diploma, I built many projects and consolidated my basics. My final project is developed in <b>Python</b>, a web game using <b>Flask</b>. It's a simple card game with the constraint of only using CSS. I also learned <b>C</b> during the course.",
    "VIII.This Website",
    "I learned to make a responsive website by reading other developers' code. I wanted to put that into practice by building my CV.",
    "My Number:",
    "06.26.82.03.47",
    "Copy",
    "My Email:",
    "maheutnicolas30@gmail.com",
    "Copy"
  ]
}
