{
  "name": "eng",
  "icon": "🇬🇧",
  "text": [
    "Maheut Nicolas",
    "CV",
    "About Me",
    "Experience",
    "Project",
    "Contact Me",
    "Welcome",
    "For my CV <b>click</b> the picture on the right",
    "For my CV <b>click</b> the picture down bellow",
    "<b>Scroll down</b> for my introduction",
    "Cook for 7 years",
    "I work for <b>7 years</b> in the food service as a cook, Of which, 2 years as a waiter too.<br>For a total of <b>4 restaurant</b> after my certificate",
    "My passion",
    "I love to <b>learning</b> new thing, I am a really curious person.<br>For this reason, I like the <b>game of GO</b> and fall in love with the <b>monocycle</b>.<br>I enjoy <b>Puzzle game</b> too.",
    "My skills",
    "My passion for puzzle game make me really good at <b>solving problem</b>.<br>I became good at <b>communication</b> throught my experience as a waiter.<br> And I developpe a good <b>stress tolerance</b> as a cook.",
    "Why Dev ?",
    "Following a recommendation from a friend and my curiosity.<br>I start to code for fun <b>3 years ago</b> and i love it.<br>I can <b>solve problem</b> and build something out of it.",
    "Reconversion",
    "I want to <b>challenge myself</b> and explore other part of our world when I am young.<br> IT developement is a way I want to continue and strong of my actual experience,<br>I can have <b>another point of view</b> than traditional IT Dev.",
    "My learning and professionnal experience",
    "Details about my journey",
    "Bac Pro Cuisine",
    "I studied <b>3 years</b> to obtained Professional A-Level Grade in Catering, with experience in 3 kitchens :<br>- Auberge de l'atre<br>- Chateaux de saint de Sabine<br>- Hotel Adler (Deutschland)",
    "BTS Hotelerie Restauration",
    "Equivalent to a <b>2 years</b> professional diploma, with experience as a manager in Flunch.",
    "Hotel du Commerce",
    "<b>2 mouth</b> as a kitchen assistant and dish washer, right after my diploma.",
    "Cafe Leo",
    "Small experience of <b>2 mouth</b>,<br> I learned more about reserve management and kitchen's back.",
    "Abbaye de la Bussière",
    "Work with a MOF (Best workers in France) who teach me all the basic I didn't have for <b>1 years</b>.",
    "Ritchie's Dinners",
    "<b>4 years</b> of experience, I started by cooking and I pass in cashier and waiter position after 2 years",
    "CS50 computer science",
    "I pass <b>CS50</b> after my works hours after <b>3 years</b> of self-taught computer science.",
    "My Dev Project",
    "The projects who keep me growing",
    "I.Tic Tac Toe",
    "My first real Program in <b>java</b>, program really simple and everything is in one class (really bad code), I make it with java swing, who is really outdated now.",
    "II.Margin Calculation",
    "I progress and learn from my mistake and I try to dev something useful in <b>java</b>,<br> The program is use to compute margin with a list of cost",
    "III.Text-based RPG",
    "In the light to learn more about oriented-programming.<br> I try to dev a text-based RPG in <b>java</b>. With little knowledge, I messed up the structure and can't make futher progress ( restart the project 3 times)",
    "IV.pathfinding Algo",
    "With a friend in pair-programming, we try to expend our knowledge.<br> We dev a simple pathfinding from scratch : Breath search.<br>We visite each node and compute the distance (pythagore) to the end point.<br>We build it in <b>Javascript.</b>",
    "V.Plugin Minecraft",
    "I try to help a friend debug some plugin in a server minecraft. I learn to read and analyze code that not mine.<br> Minecraft is a game made in <b>java</b>",
    "VI.WebSite Margin",
    "My biggest project so far. I rewrite all the code of margin calculation to a website, with a front-end in <b>JS</b> and a back-end in <b>java</b> with <b>springBoot</b>. And I install everything on a rented ubuntu server.",
    "VII.CS50",
    "Other than a certificate, I build a lot of project and relarn all the basics. My final project is a <b>Python</b> web game using <b>flask</b>. A simple card game with the use of only css to style it. I learn <b>C</b> too here",
    "VIII.This Website",
    "I read code of other dev to understand how to make a responsive website, I put that into practice with my CV.",
    "My Number :",
    "06.26.82.03.47",
    "Copy Tel",
    "My Email :",
    "maheutnicolas30@gmail.com",
    "Copy Mail"
  ]
}
