{
  "name": "fr",
  "icon": "🇫🇷",
  "text": [
    "Maheut Nicolas",
    "CV",
    "Introduction",
    "Experience",
    "Projet",
    "Contacter Moi",
    "Bienvenue",
    "<b>Clickez</b> sur l'image de droite pour mon CV",
    "<b>Clickez</b> sur l'image en bas pour mon CV",
    "<b>Scroll down</b> pour ma présentation",
    "7 ans en cuisine",
    "J'ai travailler pendant <b>7 ans</b> en tant que cuisinier, dont 2 ans aussi en tant que serveur.<br>J'ai travailler dans <b>4 restaurants</b> après mes dîplomes",
    "Mes passions",
    "J'aime <b>apprendre</b>, je suis une personne naturellement curieuse.<br>Pour cette raison, J'ai découvert le <b>jeu de GO</b>, adorer le <b>monocycle</b>.<br>Je me passionne pour les <b>jeux d'enigme</b> aussi.",
    "Mes compétences",
    "Ma passion pour les jeux d'égnimes ont dévellopper ma capacité a <b>résoudre des problêmes</b>.<br>Je suis devenu bon en <b>communication</b> a travers mon expérience de serveur.<br> Enfin, j'ai acquérie une bonne <b>tolérance au stress</b> en tant que cuisinier.",
    "Autre compétences",
    "Je m'intéresse aussi a la <b>comptabilité</b> ayant fait un BTS orienté gestion, cette compétences m'a permis d'aider de <b>conseiller</b> des personnes ainsi que d'<b>investir</b> en bourse.",
    "Pourquoi Dev ?",
    "Après avoir suivie une recommendation d'un ami et ma curiosité,<br>J'ai commencer a coder pour m'amuser, il y a <b>4 ans</b> et j'ai adorer.<br>Je peux <b>résoudre des problêmes</b> et construire quelque choses.",
    "Reconversion",
    "Je veux me reconvertir pour le <b>challenge</b> et agrandir mes horizons pendant que je suis jeune.<br>Le dévellopement informatique est la voie que je veux suivre. Et fort de mes expériences,<br>Je peux apporter un <b>autre point de vue</b> que des personnes ayant suivie une voie traditionnelle",
    "Mon expérience d'apprentisage et professionel",
    "Détail de mon parcours",
    "Bac Pro Cuisine",
    "J'ai étudié <b>3 ans</b> pour obtenir mon baccalauréat professionnel de cuisine. J'ai aussi effectué 3 stages :<br>- Auberge de l'atre<br>- Chateaux de saint de Sabine<br>- Hotel Adler (Allemagne)",
    "BTS Hotelerie Restauration",
    "J'ai étudiez <b>2 ans</b> pour obtenir mon BTS option mercatique et gestion, j'ai aussi fait un stage en tant que manager a Flunch.",
    "Hotel du Commerce",
    "<b>2 mois</b> de plongeurs et commis de cuisine, juste après mes dîplomes.",
    "Cafe Leo",
    "Petites experiences de <b>2 mois</b>,<br> j'en ai appris d'avantage sur la gestions des réserves, et l'organisation.",
    "Abbaye de la Bussière",
    "J'ai travailler pour un MOF (Meilleurs Ouvrier de France), apprennant toutes les bases manquante du métiers pendant <b>1 ans</b>.",
    "Ritchie's Dinners",
    "Pendant <b>4 ans</b>, j'ai travailler en tant que cuisinier et les 2 dernières années aussi enn tant que serveur.",
    "CS50 computer science",
    "J'ai passé <b>CS50</b> après mes heures de travail et <b>3 ans</b> d'apprentisage en autodidacte.",
    "Mes projets de develloppeur",
    "Les Projets qui m'ont fait grandir en tant que develloppeur.",
    "I.Tic Tac Toe",
    "Mon premier programme en <b>java</b>, programme très simple et très mal réaliser. Je l'ai fais avec Java <b>Swing</b>, qui est largement obsolète.",
    "II.Margin Calculation",
    "Après avoir appris de mes erreurs, j'ai essayer de coder un programme utiles en <b>java</b>,<br> Le programme calcule des marges avec une listes de coûts fixes et variables.",
    "III.Text-based RPG",
    "En programmation orienté objet.<br> J'ai dévelloppé un petit RPG en <b>javaFX</b> et <b>sqlLite</b> pour la DB. Avec peu de connaissance dans le sujet, la structure étant trop compliqué, j'ai recommencer entièrement le projet 3 fois.",
    "IV.pathfinding Algo",
    "En programmation en Binôme, On a develloppé de rien un programme de pathfinding : Breath search.<br> On visite les cases alentours, calcule la distance (pythagore) et les classe dans un list de case a visité. Réaliser en <b>Javascript.</b>",
    "V.Plugin Minecraft",
    "J'ai aider à la maintenance d'un serveur minecraft. J'ai appris à lire et à analyser du code qui n'est pas de moi.<br> Minecraft est un jeu fait en <b>java</b>",
    "VI.WebSite Margin",
    "Mon plus gros projet. J'ai réecris tous le code de Margin Calculation pour l'installer sur le web. Avec un front-end en <b>JS</b>, un back-end en <b>java</b> avec <b>springBoot</b> et un DB avec <b>MySql</b>. J'ai installer le tous sur un serveur ubuntu que j'ai loué.",
    "VII.CS50",
    "Autre qu'un dîplome, j'ai construit beaucoups de projet et consilder mes bases. Mon projet final est dévelloppé en <b>Python</b>, un jeu web qui utlise <b>flask</b>. Il s'agit d'un simple jeu de carte avec comme contrainte de n'utilliser que css. J'ai aussi appris <b>C</b> lors de la formation.",
    "VIII.This Website",
    "J'ai appris à faire un site web responsive en lisant le code d'autre develloppeur, J'ai voulu mettre ça en pratique en construisant mon CV.",
    "Mon Numéro :",
    "06.26.82.03.47",
    "Copier",
    "Mon Mail :",
    "maheutnicolas30@gmail.com",
    "Copier"
  ]
}
